app/Controllers/Auth.php

    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UtilisateurModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `username` = 'john doe'
 LIMIT 1

    public function register()
    {

        $username = $this->request->getPost('reg_username');
        $password = password_hash($this->request->getPost('reg_password'), PASSWORD_BCRYPT);
        $email = $this->request->getPost('reg_email');
        $telephone = $this->request->getPost('reg_telephone');

        $userModel = new UtilisateurModel();
        $image = new ImageModel();

        //verification de username et email
        if ($userModel->where('username', $username)->find()){
            return redirect()->back()->withInput()->with('error', ' username existe déja !');
        }
        if ($userModel->isExists('email', $email)){
            return redirect()->back()->withInput()->with('error', 'Cet e-mail existe déja !');
        }

        $image_id = $image->insert([
            'path' => DIRECTORY_SEPARATOR .'assets' . DIRECTORY_SEPARATOR . 'uploads'.DIRECTORY_SEPARATOR . 'user.png'
        ]);
        //enregistrer le nouvel utilisateur
        $user = $userModel->insert([
            'username' => $username,
            'password' => $password,
            'email' => $email,
            'image_id' => $image_id,
            'telephone' => $telephone,
        ]);
---
SELECT *
FROM `utilisateurs`
WHERE `username` = 'b'
INSERT INTO `images` (`path`) VALUES ('\\assets\\uploads\\user.png')
INSERT INTO `utilisateurs` (`username`, `password`, `email`, `image_id`, `telephone`) VALUES ('b', '$2y$10$p99sFyabKRHoLoayGyoKG.wlX4cllHws31CH5kyT0V7RWoNBxNtwW', 'b@gmail.com', 11, '1234')