app/Controllers/Post.php

    public function index(): string | array
    {
        // return to Auth page if not authentified
        if (!session()->has('id'))
            return view('auth_view');
        $publication = new PublicationModel();
        $images = new ImageModel();

        $data["posts"] = $publication->getPublication();

        // get image of each post
        foreach ($data['posts'] as $key => $post) {
            array_push($data['posts'][$key], $images->select('images.path')->where('publication_id', $post['publication_id'])->findAll(2));
---
SELECT `images`.`path`
FROM `images`
WHERE `publication_id` = '3'
 LIMIT 2

    public function create() {
        if (!session()->has('id'))
            return view('auth_view');
        $utilisateur = new UtilisateurModel();
        $images = new ImageModel();

        $data['utilisateur'] = $utilisateur->select('utilisateurs.id, utilisateurs.username, image_id')
            ->where('id', session()->get('id'))
            ->first();
        // get the image profile of user
        $data["imageProfile"] = $images->select("path")->find($data["utilisateur"]["image_id"]);
---
SELECT `utilisateurs`.`id`, `utilisateurs`.`username`, `image_id`
FROM `utilisateurs`
WHERE `id` = '1'
 LIMIT 1
SELECT `path`
FROM `images`
WHERE `images`.`id` = '1'