app/Controllers/Profile_controller.php

    public function index(){
        if (!session()->has('id'))
            return view('auth_view');
        $modele_publication = new PublicationModel();
        $modele_utilisateur = new UtilisateurModel();
        $images = new ImageModel();

        $data = [
            "posts" => $modele_publication->where('id_utilisateur', session()->get('id'))->getPublication(),
            "nb_posts" => $modele_publication->where('id_utilisateur', session()->get('id'))->countAllResults(),
            "utilisateur" => $modele_utilisateur->select('utilisateurs.id, utilisateurs.username, utilisateurs.email, utilisateurs.telephone, image_id, utilisateurs.created_ad')
                            ->where('id', session()->get('id'))
                            ->first()
        ];

        // get the image profile of user
        $data["imageProfile"]= $images->select("path")->find($data["utilisateur"]["image_id"]);
        // get image of each post
        foreach ($data['posts'] as $key => $post) {
            array_push($data['posts'][$key], $images->select('images.path')->where('publication_id', $post['publication_id'])->findAll(2));
---
SELECT COUNT(*) AS `numrows`
FROM `publications`
WHERE `id_utilisateur` = '2'
SELECT `utilisateurs`.`id`, `utilisateurs`.`username`, `utilisateurs`.`email`, `utilisateurs`.`telephone`, `image_id`, `utilisateurs`.`created_ad`
FROM `utilisateurs`
WHERE `id` = '2'
 LIMIT 1
SELECT `path`
FROM `images`
WHERE `images`.`id` = '4'
SELECT `images`.`path`
FROM `images`
WHERE `publication_id` = '3'
 LIMIT 2